# Write a program that draws a rectangle with asterisks (*) around its perimeter.
#
# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

print('*****************')
print('*               *')
print('*               *')
print('*****************')
