# As you know, integers in the Python language do not have the restrictions
# that are found in other programming languages. Write a program that reads
# four positive integers a,b,c,d and displays the value of the expression a^b + c^d.
#
# Как известно, целые числа в языке Python не имеют ограничений, которые
# встречаются в других языках программирования. Напишите программу, которая
# считывает четыре целых положительных числа a,b,c,d и выводит на экран значение выражения a^b + c^d.

a = int(input())
b = int(input())
c = int(input())
d = int(input())
print(a ** b + c ** d)
