# Write a program that determines if a number is odd or even.
#
# Напишите программу, которая определяет, является число четным или нечетным.


num = int(input())
if num % 2 == 0:
    print('Четное')
else:
    print('Нечетное')