# Выведите текстовое сообщение: 'Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.';
# Уточните как зовут пользователя;
# Выведите слова приветствия, например, 'Привет Тимур'.

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print('Давай познакомимся! ')
name = input('Напиши своё имя: ')
print(f'Привет {name}')
