# Write a program that finds the total number of meters given the number of centimeters.
#
# Напишите программу, которая находит полное число метров по заданному числу сантиметров.

centimeters = int(input())
meters = 100
print(centimeters // meters)
