# Write a program that reads three integers and displays their sum on the screen.
# Each number is written on a separate line.
# Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
# Каждое число записано в отдельной строке.

# num1 = int(input())
# num2 = int(input())
# num3 = int(input())
# print(num1 + num2 + num3)

print((num1 := int(input('ВВедите число 1'))) + (num2 := int(input('ВВедите число 2'))) + (
    num3 := int(input('ВВедите число 3'))))
