# Write a program to calculate the value of the function F(a,b) = 3(a+b)^3+275b^2-127a-41
# given integer values a and b.
# Напишите программу вычисления значения функции F(a,b) = 3(a+b)^3+275b^2-127a-41
# по введеным целым значениям a и b.

a = int(input())
b = int(input())
print(3*(a+b)**3+275*b**2-127*a-41)