# Write a program that reads two lines from the keyboard - the user's first and last name and outputs the phrase:
#
# Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:
#
# «Hello [введенное имя] [введенная фамилия]! You just delved into Python».

firstname = input('Your name: ')
lastname = input('Your last name: ')
print('«Hello ' + firstname + ' ' + lastname + '! You just delved into Python».')
