# Write a program that reads the name of a football team from the keyboard and prints out the phrase:
#
# Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:
#
# Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов

team = input()
print('Футбольная команда ', team, ' имеет длину ', len(team), ' символов')
