# Напишите программу, которая считывает одну строку, после чего выводит «YES»,
# если в введенной строке есть подстрока «синий» и «NO» в противном случае.
#
# Формат входных данных
# На вход программе подается одна строка.


print('YES' if 'синий' in input() else 'NO')
