# Given a sentence and the number of times it must be repeated.
# Write a program that repeats the given sentence as many times as needed.
#
# Дано предложение и количество раз которое его надо повторить.
# Напишите программу, которая повторяет данное предложение нужное количество раз.

lenth, count = input(), int(input())

for _ in range(count):
    print(lenth)
