# The input to the program is a natural number n.
# Write a program that prints an n×19 star rectangle.
#
# На вход программе подается натуральное число n.
# Напишите программу, которая печатает звездный прямоугольник размерами n×19.

for _ in range(int(input())):
    print('*' * 19)
