# Given a positive real number. Print its fractional part.
#
# Дано положительное действительное число. Выведите его дробную часть.

print(float(input()) % 1)
