# Two integers m and n (m≤n) are given. Write a program that prints all numbers from m to n inclusive.
#
# Даны два целых числа m и n (m≤n). Напишите программу, которая выводит все числа от m до n включительно.

for i in range(int(input()), int(input()) + 1):
    print(i)
