# Write a program that displays the text "Hello, World!" (without quotes).
# Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).

print("Здравствуй, мир!")

print("Hello, World!")
