# In the popular series Lost, the sequence of numbers 4 8 15 16 23 42 was used,
# which brought good luck to the characters and helped hit the lottery jackpot.
# Write a program that prints the given sequence of numbers with one space between them.

# В популярном сериале «Остаться в живых» использовалась последовательность чисел 4 8 15 16 23 42,
# которая принесла героям удачу и помогла сорвать джекпот в лотерее.
# Напишите программу, которая выводит данную последовательность чисел с одним пробелом между ними.

print("4", "8", "15", "16", "23", "42")