# Write a program, that prints the specified triangle consisting of asterisks (*).

# Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).

print("*")
print("**")
print("***")
print("****")
print("*****")
print("******")
print("*******")