# The input to the program is a string of text - the name of the person.
# Write a program that displays a greeting in the form of the word "Hello" (without quotes),
# followed by a comma and a space, and then the name you typed.

# На вход программе подается строка текста – имя человека.
# Напишите программу, которая выводит на экран приветствие в виде слова «Привет» (без кавычек),
# после которого должна стоять запятая и пробел, а затем введенное имя.

name = input('Your name: ')
print("Hello,", name)

name = input('Ваше имя: ')
print("Привет,", name)
