# The input to the program is a string of text - the name of the football team.
# Write a program that repeats it on the screen with the words "- champion!" (without quotes).

# На вход программе подается строка текста – название футбольной команды.
# Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).

name = input('Любимая команда: ')
print(name, "- чемпион!")