# Write a program that reads three lines in turn and then outputs them in the same sequence,
# each on a separate line.

# Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности,
# каждую на отдельной строчке.

line1 = input('Строка 1: ')
line2 = input('Строка 2: ')
line3 = input('Строка 3: ')
print(line1)
print(line2)
print(line3)
