### Производительность кода
Под производительностью кода в простейшем случае можно подразумевать то, сколько времени программа тратит на решение задачи.   
При написании программы, программист должен думать над тем, сколько времени в худшем случае потребуется его программе для решения задачи.

Рассмотрим задачу, которая проверяет число на простоту.

* 1 версия программы: Перебираем все числа от 2 до num - 1 и делаем проверку делимости числа num на i:
````python
num = int(input())
flag = True

for i in range(2, num):
    if num % i == 0:
        flag = False
if num > 1 and flag == True:
    print('Число простое')
else:
    print('Число составное')
````
Если программе на вход подается простое число num = 1934234249, то она будет работать примерно 270 секунд = 4.5 минуты.🙄

* 2 версия программы: Несложно понять, что перебирать все числа от 2 до num - 1 не имеет смысла.   
* Достаточно проверить числа от 2 до num // 2 + 1:
````python
num = int(input())
flag = True

for i in range(2, num // 2 + 1):
    if num % i == 0:
        flag = False
if num > 1 and flag == True:
    print('Число простое')
else:
    print('Число составное')
````
Если программе на вход подается простое число num = 1934234249, то она будет работать примерно 130 секунд = 2.2 минуты.   
По сути мы улучшили время работы программы вдвое! 😊

* 3 версия программы: Правую границу num // 2 + 1 проверки можно улучшить, если заметить, что у любого составного числа   
есть делитель (отличный от 1), не превосходящий квадратного корня из числа.
````python
num = int(input())
flag = True

for i in range(2, int(num ** 0.5) + 1):
    if num % i == 0:
        flag = False
if num > 1 and flag == True:
    print('Число простое')
else:
    print('Число составное')
````
Если программе на вход подается простое число num = 1934234249, то она будет работать примерно 0.066 секунд.   
По сути мы улучшили время работы программы в 4000 раз! 😎

* 4 версия программы: Предыдущие оптимизации касались случая, когда проверяемое число является простым. В случае если число является составным и мы нашли его первый делитель (отличный от 1), мы прерываем цикл с помощью оператора break:
````python
num = int(input())
flag = True

for i in range(2, int(num ** 0.5) + 1):
    if num % i == 0:
        flag = False
        break
if num > 1 and flag == True:
    print('Число простое')
else:
    print('Число составное')
````

## Примеры
1. Требовалось написать программу, которая выводит символ А 10 раз. Вы ревьювите следующий код:
````python
print('A')
print('A')
print('A')
print('A')
print('A')
print('A')
print('A')
print('A')
print('A')
print('A')
````

Ревью. Приведенный код выполняет поставленную задачу, однако его можно улучшить.   
Поскольку действия в строках одинаковые, то можно использовать цикл.   
Поскольку мы знаем количество повторений (итераций), то нам подходит цикл for:
````python
for _ in range(10):
    print('A')
````
2. Требовалось написать программу которая должна вывести все числа от 1 до 100 кратные 7. Вы ревьювите следующий код:
````python
i = 1
while i < 101:
    if i % 7 == 0:
        print(i)
        i += 1
````

Ревью. Приведенный код содержит достаточно распространенную ошибку: неверно поставленный отступ.   
Поскольку управление циклом while происходит при помощи переменной i, то ее необходимо   
инкрементировать (увеличивать) каждую итерацию. В приведенном коде она инкрементируется только если   
выполняется условие i % 7 == 0, которое ложно для начального значения i = 1. Таким образом, получаем бесконечный цикл.   
Для исправления ошибки необходимо удалить отступ у строки i += 1:
````python
i = 1
while i < 101:
    if i % 7 == 0:
        print(i)
    i += 1
````
В данном случае лучше использовать цикл for с шагом, равным 7.   
Это позволит сделать код более наглядным и сократит время выполнения программы,   
так как нет необходимости просматривать и проверять все числа на делимость на 7:
````python
for i in range(7, 101, 7):
    print(i)
````
3. Требовалось написать программу которая выводит все числа от 100 до 1 в порядке убывания. Вы ревьювите следующий код:
````python
for i in range(1, 100):
    print(101 - i)
````

Ревью. Приведенный код содержит достаточно распространенную ошибку: неправильная правая граница цикла for.   
Следует помнить, что правая граница в цикле for всегда не включительна. Таким образом,   
для исправления ошибки необходимо заменить число 100 на 101:
````python
for i in range(1, 101):
    print(101 - i)
````
В данном случае лучше использовать цикл for с шагом, равным -1:
````python
for i in range(100, 0, -1):
    print(i)
````
4. Требовалось написать программу которая находит сумму всех нечетных чисел от 1 до 1000. Вы ревьювите следующий код:
````python
a = 1
for i in range(1, 1000):
    if i % 2 == 1:
        a = a + 1
print(a)
````

Ревью. Приведенный код содержит достаточно распространенные ошибки:

* неправильная начальная инициализация переменной a; 
* неправильная правая граница цикла for;
* неправильно записанная операция накапливания значения суммы.
````python
a = 0
for i in range(1, 1001):
    if i % 2 == 1:
        a = a + i
print(a)
````
Для улучшения читабельности кода изменим название переменной a на total и используем расширенный оператор присваивания:
````python
total = 0
for i in range(1, 1001, 2):
    total += i
print(total)
````
5. Требовалось написать программу которая вычисляет факториал числа. Вы ревьювите следующий код:
````python
n = input()
a = 0
for i in range(n):
    a = a * i
print(a)
````

Ревью. Приведенный код содержит достаточно распространенные ошибки:

* отсутствие преобразования строки текста в целое число;
* неправильная начальная инициализация переменной a; 
* неправильная работа с границами итерирования: переменная i принимает значения от 0 до n - 1.
````python
n = int(input())
a = 1
for i in range(1, n + 1):
    a = a * i
print(a)
````
Для улучшения читабельности кода, изменим название переменной a на factorial и используем расширенный оператор присваивания:
````python
n = int(input())
factorial = 1
for i in range(1, n + 1):
    factorial *= i
print(factorial)
````
В модуле math есть функция factorial(), которая вычисляет факториал числа.   
Поэтому вместо реализации своей версии, куда правильнее и удобнее воспользоваться уже готовой.
