# Write a program that displays the text "I***like***Python" (without quotes) on the screen.

# Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).

print('I', 'like', 'Python', sep='***')