# Write a program that reads a delimiter string and three lines
# and then outputs the specified lines separated by a delimiter.
#
# Напишите программу, которая считывает строку-разделитель и три строки,
# а затем выводит указанные строки через разделитель.

line1 = input()
line2 = input()
line3 = input()
separater = input()
print(line1, line2, line3, sep=separater)
